# St7MoveToPlane

Aligns a model with the specified coordinate system.

long St7MoveToPlane(long uID, long SourcePlaneID, long TargetPlaneID)

Input Parameters

uID

Strand7 model file ID.

SourcePlaneID

Source PlaneID. Functions in Tools – Plane Definition  are used to define a plane and return the PlaneID.

TargetPlaneID

Target PlaneID. Functions in Tools – Plane Definition  are used to define a plane and return the PlaneID.

Dependencies
Selection

Entities can be selected using functions in Entity Selection.

Keep Selected

Assigned using St7SetKeepSelect.

Tools – Extrude

Tools – Extrude